{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 43, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "dtype": "float32", "activation": "softmax"}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 0.009999999776482582, "decay": 0.0010000000474974513, "momentum": 0.8999999761581421, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.6141166090965271, "scale": 0.003182983164693795, "dtype": "uint8"}}, {"name": "batch_normalization/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.24345391883569603, "scale": 0.002296735083355623, "dtype": "uint8"}}, {"name": "batch_normalization/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": 1.6091213898462732e-29, "scale": 0.006339105905271044, "dtype": "uint8"}}, {"name": "batch_normalization/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 1.0155167163319524e-24, "scale": 0.0042112102695539885, "dtype": "uint8"}}, {"name": "batch_normalization_1/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.6061922907829285, "scale": 0.0033288027725967705, "dtype": "uint8"}}, {"name": "batch_normalization_1/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.32227944626527677, "scale": 0.0022856698316686295, "dtype": "uint8"}}, {"name": "batch_normalization_1/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": 0.1686474084854126, "scale": 0.004503068736955231, "dtype": "uint8"}}, {"name": "batch_normalization_1/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 0.33588117361068726, "scale": 0.01680525073818132, "dtype": "uint8"}}, {"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.835239052772522, "scale": 0.0011505758061128503, "dtype": "uint8"}}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.26196201373549066, "scale": 0.002943393412758322, "dtype": "uint8"}}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": 0.10742359608411789, "scale": 0.004273036677463382, "dtype": "uint8"}}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.12533433735370636, "scale": 0.013562894042800455, "dtype": "uint8"}}, {"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.7134497165679932, "scale": 0.0027532212874468633, "dtype": "uint8"}}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.13628147162643134, "scale": 0.0008517591976651958, "dtype": "uint8"}}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": 0.011418415233492851, "scale": 0.004631195998951501, "dtype": "uint8"}}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.017907554283738136, "scale": 0.011138676917728256, "dtype": "uint8"}}, {"name": "batch_normalization_4/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.853095531463623, "scale": 0.0010384092143937652, "dtype": "uint8"}}, {"name": "batch_normalization_4/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.15469747425294392, "scale": 0.0012784915227516025, "dtype": "uint8"}}, {"name": "batch_normalization_4/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": 0.03248993307352066, "scale": 0.01623289570504544, "dtype": "uint8"}}, {"name": "batch_normalization_4/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 0.07899963855743408, "scale": 0.03924183144288904, "dtype": "uint8"}}, {"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32", "quantization": {"min": -0.671948498838088, "scale": 0.004732031681958367, "dtype": "uint8"}}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.7824358725080303, "scale": 0.005286728868297502, "dtype": "uint8"}}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"min": -0.48688158521465225, "scale": 0.0031615687351600795, "dtype": "uint8"}}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.18289605659597058, "scale": 0.0010160892033109477, "dtype": "uint8"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"min": -0.27631891743809567, "scale": 0.002109304713267906, "dtype": "uint8"}}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.12037467855740996, "scale": 0.0006577851287290162, "dtype": "uint8"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.2084722869536456, "scale": 0.001579335507224588, "dtype": "uint8"}}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.2513507626074202, "scale": 0.0010217510675098382, "dtype": "uint8"}}, {"name": "dense/kernel", "shape": [4096, 512], "dtype": "float32", "quantization": {"min": -0.11472039871356067, "scale": 0.0008313072370547875, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.01640717959871479, "scale": 0.00011085932161293778, "dtype": "uint8"}}, {"name": "dense_1/kernel", "shape": [512, 43], "dtype": "float32", "quantization": {"min": -0.23265122070032007, "scale": 0.0017759635167963364, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [43], "dtype": "float32", "quantization": {"min": -0.19524443102817907, "scale": 0.0022186867162293077, "dtype": "uint8"}}]}]}